---->  lstm_mse_0
Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 550, 40)           11360     
_________________________________________________________________
lstm_1 (LSTM)                (None, 550, 40)           12960     
_________________________________________________________________
lstm_2 (LSTM)                (None, 550, 40)           12960     
_________________________________________________________________
dense_24 (Dense)             (None, 550, 1)            41        
=================================================================
Total params: 37,321
Trainable params: 37,321
Non-trainable params: 0
_________________________________________________________________
Data: (300, 550, 30) (300, 550, 1) (0,) (0,) (182, 550, 30) (182, 550, 1)

Epoch 400/400
2/2 - 2s - loss: 0.0745 - mean_squared_error: 0.0744 - mean_absolute_percentage_error: 15217009.0000 - root_mean_squared_error: 0.2728
output/final_lstm_mse_al_speed_limit_0_adam_epoch=400
